---
title: ViewScheduleExportOptions
classe: Autodesk.Revit.DB.ViewScheduleExportOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ViewScheduleExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ExportColumnHeaders ColumnHeaders { get; set; }` | `viewScheduleExportOptions.ColumnHeaders` | ExportColumnHeaders |
| `String FieldDelimiter { get; set; }` | `viewScheduleExportOptions.FieldDelimiter` | String |
| `Boolean HeadersFootersBlanks { get; set; }` | `viewScheduleExportOptions.HeadersFootersBlanks` | Boolean |
| `Boolean IsValidObject { get; }` | `viewScheduleExportOptions.IsValidObject` | Boolean |
| `ExportTextQualifier TextQualifier { get; set; }` | `viewScheduleExportOptions.TextQualifier` | ExportTextQualifier |
| `Boolean Title { get; set; }` | `viewScheduleExportOptions.Title` | Boolean |
| `Void Dispose()` | `viewScheduleExportOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```